[
  {
    "title": "Case Study 4",
    "date": "2024-11-05",
    "description": "Goal:\r\nBoston Housing Data: Analyze and Model Housing Data using CART (Classification and Regression Trees) and Linear Regression. \r\nGerman Credit Data: Classify Credit Defaults Using Decision Trees",
    "methodology": "Boston Housing Data: \r\n-Loaded data from the MASS library.\r\n-Split into 90% training and 10% testing.\r\n-Built and visualized a regression tree model predicting the target median home value (medv).\r\n-Visualized the regression tree using the prp function.\r\n-Calculated in-sample MSE (Mean Squared Error) at 17.2 and out-of-sample MSE at 27.4, indicating possible overfitting.\r\n-Created a linear regression model, excluding ‘indus’ and ‘age’ variables.\r\n-The linear regression model had in-sample MSE of 21.5 and out-of-sample MSE of 25.5, showing that CART might fit non-linear relationships better.\r\nGerman Credit Data: \r\n-Loaded and preprocessed German Credit data, converting categorical variables into factors.\r\n-Split the dataset into 80% training and 20% testing.\r\n-Built a classification tree predicting credit defaults.\r\n-Developed a second model applying a weighted cost matrix (false negatives cost 5x more than false positives).\r\n-Compared the models and evaluated misclassification costs.\r\n-Tested out-of-sample performance, showing possible improvements in handling misclassifications.",
    "technologies": [
      "R",
      "Decision Trees",
      "Regression Models",
      "CART",
      "Data Visualization"
    ],
    "thumbnail": "assets/images/default.png",
    "liveDemo": "",
    "repoUrl": "",
    "codeFiles": [],
    "reportPdf": "assets/files/CaseStudy4.pdf",
    "overview": {
      "story": "-Examined real-world housing and credit data to build predictive models.\r\n-Compared different machine learning techniques to evaluate their effectiveness.",
      "collectedData": "-Boston Housing dataset (various real estate features).\r\n-German Credit dataset (loan defaults and financial indicators).",
      "conclusions": "-Boston Housing dataset (various real estate features).\r\n-German Credit dataset (loan defaults and financial indicators)."
    }
  }
]
